package lt.lhu.unit02.main;

/* Выведите на экран следующий текст.
Пройдет много лет, и полковник Аурелиано Буэндиа, 
стоя у стены в ожидании расстрела, вспомнит тот далекий вечер, 
когда отец взял его с собой посмотреть на лед. 
Макондо было тогда небольшим селением с двумя десятками хижин, 
выстроенных из глины и бамбука на берегу реки, которая мчала 
свои прозрачные воды ...
*/

public class Task01 {

	public static void main(String[] args) {
		System.out.println("Пройдет много лет, и полковник Аурелиано Буэндиа,"
				+ " стоя у стены в ожидании расстрела, вспомнит тот далекий вечер,"
				+ " когда отец взял его с собой посмотреть на лед. "
				+ "Макондо было тогда небольшим селением с двумя десятками хижин, "
				+ "выстроенных из глины и бамбука на берегу реки, " + "которая мчала свои прозрачные воды ...");

	}

}
